app/Http/Controllers/HomeController.php

    public function index(Request $request)
    {

        $cantidadFichasTecnicas = FichaTecnica::count();
---
select count(*) as aggregate from `ficha_tecnicas`