app/Http/Controllers/InventarioController.php

    public function index(){

        return view('inventarios.index',[

            'inventarios' => Inventario::with('user')->orderBy('id', 'DESC')->get()
---
select * from `inventarios` order by `id` desc
select * from `users` where `users`.`id` in (2)